; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2125)
	(= (fuel plane1) 422)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city2)
	(= (capacity plane2) 5325)
	(= (fuel plane2) 1761)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city0)
	(= (capacity plane3) 13282)
	(= (fuel plane3) 2680)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city0)
	(= (capacity plane4) 5094)
	(= (fuel plane4) 1956)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 7)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city1)
	(at person5 city2)
	(at person6 city1)
	(at person7 city2)
	(at person8 city1)
	(at person9 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 782)
	(= (distance city0 city2) 805)
	(= (distance city1 city0) 782)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 752)
	(= (distance city2 city0) 805)
	(= (distance city2 city1) 752)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city2)
	(at plane3 city0)
	(at person1 city0)
	(at person2 city2)
	(at person3 city0)
	(at person4 city0)
	(at person5 city2)
	(at person6 city2)
	(at person7 city2)
	(at person8 city0)
	(at person9 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 422 to 2125
   goals met: 5 of 11
2. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 11
3. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 805, (fuel plane1) from 2125 to 1320
   goals met: 6 of 11
4. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 805 to 2415, (fuel plane2) from 1761 to 151
   goals met: 6 of 11
5. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 11
6. (board person2 plane4 city0)
   deleted: (at person2 city0)
   added: (in person2 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 7 of 11
7. (fly plane4 city0 city2)
   deleted: (at plane4 city0)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 2415 to 4025, (fuel plane4) from 1956 to 346
   goals met: 7 of 11
8. (debark person2 plane4 city2)
   deleted: (in person2 plane4)
   added: (at person2 city2)
   changed: (onboard plane4) from 1 to 0
   goals met: 8 of 11
9. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 4025 to 4777, (fuel plane1) from 1320 to 568
   goals met: 7 of 11
10. (refuel plane1 city1)
   changed: (fuel plane1) from 568 to 2125
   goals met: 7 of 11
11. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 11
12. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 11
13. (board person8 plane1 city1)
   deleted: (at person8 city1)
   added: (in person8 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 7 of 11
14. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4777 to 5559, (fuel plane1) from 2125 to 1343
   goals met: 7 of 11
15. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 11
16. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 9 of 11
17. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 5559 to 6364, (fuel plane1) from 1343 to 538
   goals met: 10 of 11
18. (debark person6 plane1 city2)
   deleted: (in person6 plane1)
   added: (at person6 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 11 of 11
